УчетВУправляющихДляГит1/src/Documents/УПЖКХ_УстановкаСобственниковПомещений/УПЖКХ_УстановкаСобственниковПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УПЖКХ_УстановкаСобственниковПомещений</name>
  <registerRecords>InformationRegister.УПЖКХ_СобственностьНаПомещения</registerRecords>
  <registerRecords>InformationRegister.УПЖКХ_СобственникиПомещений</registerRecords>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.КВП_Здания</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.УПЖКХ_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобственности</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСобственников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпределитьДолиСобственности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыОперацийСобственности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Собственники</name>
    <attributes>
      <name>Собственник</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеПолученияВСобственность</name>
      <type>
        <types>CatalogRef.УПЖКХ_ОснованияПолученияВСобственностьПомещений</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.УПЖКХ_ДокументыНаПравоСобственности</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСобственникаЧислитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСобственникаЗнаменатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСобственности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УПЖКХ_УстановкаСобственниковПомещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Ответственный,
	|	Реквизиты.Комментарий,
	|	Реквизиты.Здание,
	|	Реквизиты.Помещение,
	|	Реквизиты.ВидСобственности,
	|	Реквизиты.НесколькоСобственников,
	|	Реквизиты.ОпределитьДолиСобственности,
	|	Реквизиты.ВидОперации
	|ИЗ
	|	Документ.УПЖКХ_УстановкаСобственниковПомещений КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Ответственный,Комментарий,Здание,ВидОперации,
								|Помещение,ВидСобственности,НесколькоСобственников,ОпределитьДолиСобственности");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
